---
type: InitialLuminousIntensity
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 2
tags: [revit-api, class]
---

# InitialLuminousIntensity

`Autodesk.Revit.DB.Lighting.InitialLuminousIntensity` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | InitialLuminousIntensity | — | `` |
| Property | Luminosity | 2013 | `public double Luminosity { get ; set ; }` |